Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/pmerrloc.h
/**
 * \brief Component description for PMERRLOC
 *
 * Copyright (c) 2019 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2019-02-20T18:44:00Z */
#ifndef _SAM9X_PMERRLOC_COMPONENT_H_
#define _SAM9X_PMERRLOC_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR PMERRLOC                                     */
/* ************************************************************************** */

/* -------- PMERRLOC_ELCFG : (PMERRLOC Offset: 0x00) (R/W 32) Configuration Register -------- */
#define PMERRLOC_ELCFG_SECTORSZ_Pos           _U_(0)                                               /**< (PMERRLOC_ELCFG) Sector Size Position */
#define PMERRLOC_ELCFG_SECTORSZ_Msk           (_U_(0x1) << PMERRLOC_ELCFG_SECTORSZ_Pos)            /**< (PMERRLOC_ELCFG) Sector Size Mask */
#define PMERRLOC_ELCFG_SECTORSZ(value)        (PMERRLOC_ELCFG_SECTORSZ_Msk & ((value) << PMERRLOC_ELCFG_SECTORSZ_Pos))
#define PMERRLOC_ELCFG_ERRNUM_Pos             _U_(16)                                              /**< (PMERRLOC_ELCFG) Number of Errors Position */
#define PMERRLOC_ELCFG_ERRNUM_Msk             (_U_(0x1F) << PMERRLOC_ELCFG_ERRNUM_Pos)             /**< (PMERRLOC_ELCFG) Number of Errors Mask */
#define PMERRLOC_ELCFG_ERRNUM(value)          (PMERRLOC_ELCFG_ERRNUM_Msk & ((value) << PMERRLOC_ELCFG_ERRNUM_Pos))
#define PMERRLOC_ELCFG_Msk                    _U_(0x001F0001)                                      /**< (PMERRLOC_ELCFG) Register Mask  */


/* -------- PMERRLOC_ELPRIM : (PMERRLOC Offset: 0x04) ( R/ 32) Primitive Register -------- */
#define PMERRLOC_ELPRIM_PRIMITIV_Pos          _U_(0)                                               /**< (PMERRLOC_ELPRIM) Primitive Polynomial Position */
#define PMERRLOC_ELPRIM_PRIMITIV_Msk          (_U_(0xFFFF) << PMERRLOC_ELPRIM_PRIMITIV_Pos)        /**< (PMERRLOC_ELPRIM) Primitive Polynomial Mask */
#define PMERRLOC_ELPRIM_PRIMITIV(value)       (PMERRLOC_ELPRIM_PRIMITIV_Msk & ((value) << PMERRLOC_ELPRIM_PRIMITIV_Pos))
#define PMERRLOC_ELPRIM_Msk                   _U_(0x0000FFFF)                                      /**< (PMERRLOC_ELPRIM) Register Mask  */


/* -------- PMERRLOC_ELEN : (PMERRLOC Offset: 0x08) (R/W 32) Enable Register -------- */
#define PMERRLOC_ELEN_ENINIT_Pos              _U_(0)                                               /**< (PMERRLOC_ELEN) Initial Number of Bits in the Codeword Position */
#define PMERRLOC_ELEN_ENINIT_Msk              (_U_(0x3FFF) << PMERRLOC_ELEN_ENINIT_Pos)            /**< (PMERRLOC_ELEN) Initial Number of Bits in the Codeword Mask */
#define PMERRLOC_ELEN_ENINIT(value)           (PMERRLOC_ELEN_ENINIT_Msk & ((value) << PMERRLOC_ELEN_ENINIT_Pos))
#define PMERRLOC_ELEN_Msk                     _U_(0x00003FFF)                                      /**< (PMERRLOC_ELEN) Register Mask  */


/* -------- PMERRLOC_ELDIS : (PMERRLOC Offset: 0x0C) (R/W 32) Disable Register -------- */
#define PMERRLOC_ELDIS_DIS_Pos                _U_(0)                                               /**< (PMERRLOC_ELDIS) Disable Error Location Engine Position */
#define PMERRLOC_ELDIS_DIS_Msk                (_U_(0x1) << PMERRLOC_ELDIS_DIS_Pos)                 /**< (PMERRLOC_ELDIS) Disable Error Location Engine Mask */
#define PMERRLOC_ELDIS_DIS(value)             (PMERRLOC_ELDIS_DIS_Msk & ((value) << PMERRLOC_ELDIS_DIS_Pos))
#define PMERRLOC_ELDIS_Msk                    _U_(0x00000001)                                      /**< (PMERRLOC_ELDIS) Register Mask  */


/* -------- PMERRLOC_ELSR : (PMERRLOC Offset: 0x10) (R/W 32) Status Register -------- */
#define PMERRLOC_ELSR_BUSY_Pos                _U_(0)                                               /**< (PMERRLOC_ELSR) Error Location Engine Busy Position */
#define PMERRLOC_ELSR_BUSY_Msk                (_U_(0x1) << PMERRLOC_ELSR_BUSY_Pos)                 /**< (PMERRLOC_ELSR) Error Location Engine Busy Mask */
#define PMERRLOC_ELSR_BUSY(value)             (PMERRLOC_ELSR_BUSY_Msk & ((value) << PMERRLOC_ELSR_BUSY_Pos))
#define PMERRLOC_ELSR_Msk                     _U_(0x00000001)                                      /**< (PMERRLOC_ELSR) Register Mask  */


/* -------- PMERRLOC_ELIER : (PMERRLOC Offset: 0x14) ( /W 32) Interrupt Enable Register -------- */
#define PMERRLOC_ELIER_DONE_Pos               _U_(0)                                               /**< (PMERRLOC_ELIER) Computation Terminated Interrupt Enable Position */
#define PMERRLOC_ELIER_DONE_Msk               (_U_(0x1) << PMERRLOC_ELIER_DONE_Pos)                /**< (PMERRLOC_ELIER) Computation Terminated Interrupt Enable Mask */
#define PMERRLOC_ELIER_DONE(value)            (PMERRLOC_ELIER_DONE_Msk & ((value) << PMERRLOC_ELIER_DONE_Pos))
#define PMERRLOC_ELIER_Msk                    _U_(0x00000001)                                      /**< (PMERRLOC_ELIER) Register Mask  */


