Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/pmerrloc.h
/* -------- PMERRLOC_ELIDR : (PMERRLOC Offset: 0x18) ( /W 32) Interrupt Disable Register -------- */
#define PMERRLOC_ELIDR_DONE_Pos               _U_(0)                                               /**< (PMERRLOC_ELIDR) Computation Terminated Interrupt Disable Position */
#define PMERRLOC_ELIDR_DONE_Msk               (_U_(0x1) << PMERRLOC_ELIDR_DONE_Pos)                /**< (PMERRLOC_ELIDR) Computation Terminated Interrupt Disable Mask */
#define PMERRLOC_ELIDR_DONE(value)            (PMERRLOC_ELIDR_DONE_Msk & ((value) << PMERRLOC_ELIDR_DONE_Pos))
#define PMERRLOC_ELIDR_Msk                    _U_(0x00000001)                                      /**< (PMERRLOC_ELIDR) Register Mask  */


/* -------- PMERRLOC_ELIMR : (PMERRLOC Offset: 0x1C) ( R/ 32) Interrupt Mask Register -------- */
#define PMERRLOC_ELIMR_DONE_Pos               _U_(0)                                               /**< (PMERRLOC_ELIMR) Computation Terminated Interrupt Mask Position */
#define PMERRLOC_ELIMR_DONE_Msk               (_U_(0x1) << PMERRLOC_ELIMR_DONE_Pos)                /**< (PMERRLOC_ELIMR) Computation Terminated Interrupt Mask Mask */
#define PMERRLOC_ELIMR_DONE(value)            (PMERRLOC_ELIMR_DONE_Msk & ((value) << PMERRLOC_ELIMR_DONE_Pos))
#define PMERRLOC_ELIMR_Msk                    _U_(0x00000001)                                      /**< (PMERRLOC_ELIMR) Register Mask  */


/* -------- PMERRLOC_ELISR : (PMERRLOC Offset: 0x20) ( R/ 32) Interrupt Status Register -------- */
#define PMERRLOC_ELISR_DONE_Pos               _U_(0)                                               /**< (PMERRLOC_ELISR) Computation Terminated Interrupt Status Position */
#define PMERRLOC_ELISR_DONE_Msk               (_U_(0x1) << PMERRLOC_ELISR_DONE_Pos)                /**< (PMERRLOC_ELISR) Computation Terminated Interrupt Status Mask */
#define PMERRLOC_ELISR_DONE(value)            (PMERRLOC_ELISR_DONE_Msk & ((value) << PMERRLOC_ELISR_DONE_Pos))
#define PMERRLOC_ELISR_ERR_CNT_Pos            _U_(8)                                               /**< (PMERRLOC_ELISR) Error Counter Value Position */
#define PMERRLOC_ELISR_ERR_CNT_Msk            (_U_(0x1F) << PMERRLOC_ELISR_ERR_CNT_Pos)            /**< (PMERRLOC_ELISR) Error Counter Value Mask */
#define PMERRLOC_ELISR_ERR_CNT(value)         (PMERRLOC_ELISR_ERR_CNT_Msk & ((value) << PMERRLOC_ELISR_ERR_CNT_Pos))
#define PMERRLOC_ELISR_Msk                    _U_(0x00001F01)                                      /**< (PMERRLOC_ELISR) Register Mask  */


/* -------- PMERRLOC_SIGMA0 : (PMERRLOC Offset: 0x28) ( R/ 32) SIGMA0 Register -------- */
#define PMERRLOC_SIGMA0_SIGMA0_Pos            _U_(0)                                               /**< (PMERRLOC_SIGMA0) Coefficient of Degree 0 in the SIGMA Polynomial Position */
#define PMERRLOC_SIGMA0_SIGMA0_Msk            (_U_(0x3FFF) << PMERRLOC_SIGMA0_SIGMA0_Pos)          /**< (PMERRLOC_SIGMA0) Coefficient of Degree 0 in the SIGMA Polynomial Mask */
#define PMERRLOC_SIGMA0_SIGMA0(value)         (PMERRLOC_SIGMA0_SIGMA0_Msk & ((value) << PMERRLOC_SIGMA0_SIGMA0_Pos))
#define PMERRLOC_SIGMA0_Msk                   _U_(0x00003FFF)                                      /**< (PMERRLOC_SIGMA0) Register Mask  */


/* -------- PMERRLOC_SIGMA1 : (PMERRLOC Offset: 0x2C) (R/W 32) SIGMA1 Register -------- */
#define PMERRLOC_SIGMA1_SIGMA1_Pos            _U_(0)                                               /**< (PMERRLOC_SIGMA1) Coefficient of Degree x in the SIGMA Polynomial. Position */
#define PMERRLOC_SIGMA1_SIGMA1_Msk            (_U_(0x3FFF) << PMERRLOC_SIGMA1_SIGMA1_Pos)          /**< (PMERRLOC_SIGMA1) Coefficient of Degree x in the SIGMA Polynomial. Mask */
#define PMERRLOC_SIGMA1_SIGMA1(value)         (PMERRLOC_SIGMA1_SIGMA1_Msk & ((value) << PMERRLOC_SIGMA1_SIGMA1_Pos))
#define PMERRLOC_SIGMA1_Msk                   _U_(0x00003FFF)                                      /**< (PMERRLOC_SIGMA1) Register Mask  */


/* -------- PMERRLOC_SIGMA2 : (PMERRLOC Offset: 0x30) (R/W 32) SIGMA1 Register -------- */
#define PMERRLOC_SIGMA2_SIGMA2_Pos            _U_(0)                                               /**< (PMERRLOC_SIGMA2) Coefficient of Degree x in the SIGMA Polynomial. Position */
#define PMERRLOC_SIGMA2_SIGMA2_Msk            (_U_(0x3FFF) << PMERRLOC_SIGMA2_SIGMA2_Pos)          /**< (PMERRLOC_SIGMA2) Coefficient of Degree x in the SIGMA Polynomial. Mask */
#define PMERRLOC_SIGMA2_SIGMA2(value)         (PMERRLOC_SIGMA2_SIGMA2_Msk & ((value) << PMERRLOC_SIGMA2_SIGMA2_Pos))
#define PMERRLOC_SIGMA2_Msk                   _U_(0x00003FFF)                                      /**< (PMERRLOC_SIGMA2) Register Mask  */


/* -------- PMERRLOC_SIGMA3 : (PMERRLOC Offset: 0x34) (R/W 32) SIGMA1 Register -------- */
#define PMERRLOC_SIGMA3_SIGMA3_Pos            _U_(0)                                               /**< (PMERRLOC_SIGMA3) Coefficient of Degree x in the SIGMA Polynomial. Position */
#define PMERRLOC_SIGMA3_SIGMA3_Msk            (_U_(0x3FFF) << PMERRLOC_SIGMA3_SIGMA3_Pos)          /**< (PMERRLOC_SIGMA3) Coefficient of Degree x in the SIGMA Polynomial. Mask */
#define PMERRLOC_SIGMA3_SIGMA3(value)         (PMERRLOC_SIGMA3_SIGMA3_Msk & ((value) << PMERRLOC_SIGMA3_SIGMA3_Pos))
#define PMERRLOC_SIGMA3_Msk                   _U_(0x00003FFF)                                      /**< (PMERRLOC_SIGMA3) Register Mask  */


/* -------- PMERRLOC_SIGMA4 : (PMERRLOC Offset: 0x38) (R/W 32) SIGMA1 Register -------- */
#define PMERRLOC_SIGMA4_SIGMA4_Pos            _U_(0)                                               /**< (PMERRLOC_SIGMA4) Coefficient of Degree x in the SIGMA Polynomial. Position */
#define PMERRLOC_SIGMA4_SIGMA4_Msk            (_U_(0x3FFF) << PMERRLOC_SIGMA4_SIGMA4_Pos)          /**< (PMERRLOC_SIGMA4) Coefficient of Degree x in the SIGMA Polynomial. Mask */
#define PMERRLOC_SIGMA4_SIGMA4(value)         (PMERRLOC_SIGMA4_SIGMA4_Msk & ((value) << PMERRLOC_SIGMA4_SIGMA4_Pos))
#define PMERRLOC_SIGMA4_Msk                   _U_(0x00003FFF)                                      /**< (PMERRLOC_SIGMA4) Register Mask  */


/* -------- PMERRLOC_SIGMA5 : (PMERRLOC Offset: 0x3C) (R/W 32) SIGMA1 Register -------- */
#define PMERRLOC_SIGMA5_SIGMA5_Pos            _U_(0)                                               /**< (PMERRLOC_SIGMA5) Coefficient of Degree x in the SIGMA Polynomial. Position */
#define PMERRLOC_SIGMA5_SIGMA5_Msk            (_U_(0x3FFF) << PMERRLOC_SIGMA5_SIGMA5_Pos)          /**< (PMERRLOC_SIGMA5) Coefficient of Degree x in the SIGMA Polynomial. Mask */
#define PMERRLOC_SIGMA5_SIGMA5(value)         (PMERRLOC_SIGMA5_SIGMA5_Msk & ((value) << PMERRLOC_SIGMA5_SIGMA5_Pos))
#define PMERRLOC_SIGMA5_Msk                   _U_(0x00003FFF)                                      /**< (PMERRLOC_SIGMA5) Register Mask  */


/* -------- PMERRLOC_SIGMA6 : (PMERRLOC Offset: 0x40) (R/W 32) SIGMA1 Register -------- */
#define PMERRLOC_SIGMA6_SIGMA6_Pos            _U_(0)                                               /**< (PMERRLOC_SIGMA6) Coefficient of Degree x in the SIGMA Polynomial. Position */
#define PMERRLOC_SIGMA6_SIGMA6_Msk            (_U_(0x3FFF) << PMERRLOC_SIGMA6_SIGMA6_Pos)          /**< (PMERRLOC_SIGMA6) Coefficient of Degree x in the SIGMA Polynomial. Mask */
#define PMERRLOC_SIGMA6_SIGMA6(value)         (PMERRLOC_SIGMA6_SIGMA6_Msk & ((value) << PMERRLOC_SIGMA6_SIGMA6_Pos))
#define PMERRLOC_SIGMA6_Msk                   _U_(0x00003FFF)                                      /**< (PMERRLOC_SIGMA6) Register Mask  */


/* -------- PMERRLOC_SIGMA7 : (PMERRLOC Offset: 0x44) (R/W 32) SIGMA1 Register -------- */
#define PMERRLOC_SIGMA7_SIGMA7_Pos            _U_(0)                                               /**< (PMERRLOC_SIGMA7) Coefficient of Degree x in the SIGMA Polynomial. Position */
#define PMERRLOC_SIGMA7_SIGMA7_Msk            (_U_(0x3FFF) << PMERRLOC_SIGMA7_SIGMA7_Pos)          /**< (PMERRLOC_SIGMA7) Coefficient of Degree x in the SIGMA Polynomial. Mask */
#define PMERRLOC_SIGMA7_SIGMA7(value)         (PMERRLOC_SIGMA7_SIGMA7_Msk & ((value) << PMERRLOC_SIGMA7_SIGMA7_Pos))
#define PMERRLOC_SIGMA7_Msk                   _U_(0x00003FFF)                                      /**< (PMERRLOC_SIGMA7) Register Mask  */


