Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/pmerrloc.h
/* -------- PMERRLOC_SIGMA8 : (PMERRLOC Offset: 0x48) (R/W 32) SIGMA1 Register -------- */
#define PMERRLOC_SIGMA8_SIGMA8_Pos            _U_(0)                                               /**< (PMERRLOC_SIGMA8) Coefficient of Degree x in the SIGMA Polynomial. Position */
#define PMERRLOC_SIGMA8_SIGMA8_Msk            (_U_(0x3FFF) << PMERRLOC_SIGMA8_SIGMA8_Pos)          /**< (PMERRLOC_SIGMA8) Coefficient of Degree x in the SIGMA Polynomial. Mask */
#define PMERRLOC_SIGMA8_SIGMA8(value)         (PMERRLOC_SIGMA8_SIGMA8_Msk & ((value) << PMERRLOC_SIGMA8_SIGMA8_Pos))
#define PMERRLOC_SIGMA8_Msk                   _U_(0x00003FFF)                                      /**< (PMERRLOC_SIGMA8) Register Mask  */


/* -------- PMERRLOC_SIGMA9 : (PMERRLOC Offset: 0x4C) (R/W 32) SIGMA1 Register -------- */
#define PMERRLOC_SIGMA9_SIGMA9_Pos            _U_(0)                                               /**< (PMERRLOC_SIGMA9) Coefficient of Degree x in the SIGMA Polynomial. Position */
#define PMERRLOC_SIGMA9_SIGMA9_Msk            (_U_(0x3FFF) << PMERRLOC_SIGMA9_SIGMA9_Pos)          /**< (PMERRLOC_SIGMA9) Coefficient of Degree x in the SIGMA Polynomial. Mask */
#define PMERRLOC_SIGMA9_SIGMA9(value)         (PMERRLOC_SIGMA9_SIGMA9_Msk & ((value) << PMERRLOC_SIGMA9_SIGMA9_Pos))
#define PMERRLOC_SIGMA9_Msk                   _U_(0x00003FFF)                                      /**< (PMERRLOC_SIGMA9) Register Mask  */


/* -------- PMERRLOC_SIGMA10 : (PMERRLOC Offset: 0x50) (R/W 32) SIGMA1 Register -------- */
#define PMERRLOC_SIGMA10_SIGMA10_Pos          _U_(0)                                               /**< (PMERRLOC_SIGMA10) Coefficient of Degree x in the SIGMA Polynomial. Position */
#define PMERRLOC_SIGMA10_SIGMA10_Msk          (_U_(0x3FFF) << PMERRLOC_SIGMA10_SIGMA10_Pos)        /**< (PMERRLOC_SIGMA10) Coefficient of Degree x in the SIGMA Polynomial. Mask */
#define PMERRLOC_SIGMA10_SIGMA10(value)       (PMERRLOC_SIGMA10_SIGMA10_Msk & ((value) << PMERRLOC_SIGMA10_SIGMA10_Pos))
#define PMERRLOC_SIGMA10_Msk                  _U_(0x00003FFF)                                      /**< (PMERRLOC_SIGMA10) Register Mask  */


/* -------- PMERRLOC_SIGMA11 : (PMERRLOC Offset: 0x54) (R/W 32) SIGMA1 Register -------- */
#define PMERRLOC_SIGMA11_SIGMA11_Pos          _U_(0)                                               /**< (PMERRLOC_SIGMA11) Coefficient of Degree x in the SIGMA Polynomial. Position */
#define PMERRLOC_SIGMA11_SIGMA11_Msk          (_U_(0x3FFF) << PMERRLOC_SIGMA11_SIGMA11_Pos)        /**< (PMERRLOC_SIGMA11) Coefficient of Degree x in the SIGMA Polynomial. Mask */
#define PMERRLOC_SIGMA11_SIGMA11(value)       (PMERRLOC_SIGMA11_SIGMA11_Msk & ((value) << PMERRLOC_SIGMA11_SIGMA11_Pos))
#define PMERRLOC_SIGMA11_Msk                  _U_(0x00003FFF)                                      /**< (PMERRLOC_SIGMA11) Register Mask  */


/* -------- PMERRLOC_SIGMA12 : (PMERRLOC Offset: 0x58) (R/W 32) SIGMA1 Register -------- */
#define PMERRLOC_SIGMA12_SIGMA12_Pos          _U_(0)                                               /**< (PMERRLOC_SIGMA12) Coefficient of Degree x in the SIGMA Polynomial. Position */
#define PMERRLOC_SIGMA12_SIGMA12_Msk          (_U_(0x3FFF) << PMERRLOC_SIGMA12_SIGMA12_Pos)        /**< (PMERRLOC_SIGMA12) Coefficient of Degree x in the SIGMA Polynomial. Mask */
#define PMERRLOC_SIGMA12_SIGMA12(value)       (PMERRLOC_SIGMA12_SIGMA12_Msk & ((value) << PMERRLOC_SIGMA12_SIGMA12_Pos))
#define PMERRLOC_SIGMA12_Msk                  _U_(0x00003FFF)                                      /**< (PMERRLOC_SIGMA12) Register Mask  */


/* -------- PMERRLOC_SIGMA13 : (PMERRLOC Offset: 0x5C) (R/W 32) SIGMA1 Register -------- */
#define PMERRLOC_SIGMA13_SIGMA13_Pos          _U_(0)                                               /**< (PMERRLOC_SIGMA13) Coefficient of Degree x in the SIGMA Polynomial. Position */
#define PMERRLOC_SIGMA13_SIGMA13_Msk          (_U_(0x3FFF) << PMERRLOC_SIGMA13_SIGMA13_Pos)        /**< (PMERRLOC_SIGMA13) Coefficient of Degree x in the SIGMA Polynomial. Mask */
#define PMERRLOC_SIGMA13_SIGMA13(value)       (PMERRLOC_SIGMA13_SIGMA13_Msk & ((value) << PMERRLOC_SIGMA13_SIGMA13_Pos))
#define PMERRLOC_SIGMA13_Msk                  _U_(0x00003FFF)                                      /**< (PMERRLOC_SIGMA13) Register Mask  */


/* -------- PMERRLOC_SIGMA14 : (PMERRLOC Offset: 0x60) (R/W 32) SIGMA1 Register -------- */
#define PMERRLOC_SIGMA14_SIGMA14_Pos          _U_(0)                                               /**< (PMERRLOC_SIGMA14) Coefficient of Degree x in the SIGMA Polynomial. Position */
#define PMERRLOC_SIGMA14_SIGMA14_Msk          (_U_(0x3FFF) << PMERRLOC_SIGMA14_SIGMA14_Pos)        /**< (PMERRLOC_SIGMA14) Coefficient of Degree x in the SIGMA Polynomial. Mask */
#define PMERRLOC_SIGMA14_SIGMA14(value)       (PMERRLOC_SIGMA14_SIGMA14_Msk & ((value) << PMERRLOC_SIGMA14_SIGMA14_Pos))
#define PMERRLOC_SIGMA14_Msk                  _U_(0x00003FFF)                                      /**< (PMERRLOC_SIGMA14) Register Mask  */


/* -------- PMERRLOC_SIGMA15 : (PMERRLOC Offset: 0x64) (R/W 32) SIGMA1 Register -------- */
#define PMERRLOC_SIGMA15_SIGMA15_Pos          _U_(0)                                               /**< (PMERRLOC_SIGMA15) Coefficient of Degree x in the SIGMA Polynomial. Position */
#define PMERRLOC_SIGMA15_SIGMA15_Msk          (_U_(0x3FFF) << PMERRLOC_SIGMA15_SIGMA15_Pos)        /**< (PMERRLOC_SIGMA15) Coefficient of Degree x in the SIGMA Polynomial. Mask */
#define PMERRLOC_SIGMA15_SIGMA15(value)       (PMERRLOC_SIGMA15_SIGMA15_Msk & ((value) << PMERRLOC_SIGMA15_SIGMA15_Pos))
#define PMERRLOC_SIGMA15_Msk                  _U_(0x00003FFF)                                      /**< (PMERRLOC_SIGMA15) Register Mask  */


/* -------- PMERRLOC_SIGMA16 : (PMERRLOC Offset: 0x68) (R/W 32) SIGMA1 Register -------- */
#define PMERRLOC_SIGMA16_SIGMA16_Pos          _U_(0)                                               /**< (PMERRLOC_SIGMA16) Coefficient of Degree x in the SIGMA Polynomial. Position */
#define PMERRLOC_SIGMA16_SIGMA16_Msk          (_U_(0x3FFF) << PMERRLOC_SIGMA16_SIGMA16_Pos)        /**< (PMERRLOC_SIGMA16) Coefficient of Degree x in the SIGMA Polynomial. Mask */
#define PMERRLOC_SIGMA16_SIGMA16(value)       (PMERRLOC_SIGMA16_SIGMA16_Msk & ((value) << PMERRLOC_SIGMA16_SIGMA16_Pos))
#define PMERRLOC_SIGMA16_Msk                  _U_(0x00003FFF)                                      /**< (PMERRLOC_SIGMA16) Register Mask  */


/* -------- PMERRLOC_SIGMA17 : (PMERRLOC Offset: 0x6C) (R/W 32) SIGMA1 Register -------- */
#define PMERRLOC_SIGMA17_SIGMA17_Pos          _U_(0)                                               /**< (PMERRLOC_SIGMA17) Coefficient of Degree x in the SIGMA Polynomial. Position */
#define PMERRLOC_SIGMA17_SIGMA17_Msk          (_U_(0x3FFF) << PMERRLOC_SIGMA17_SIGMA17_Pos)        /**< (PMERRLOC_SIGMA17) Coefficient of Degree x in the SIGMA Polynomial. Mask */
#define PMERRLOC_SIGMA17_SIGMA17(value)       (PMERRLOC_SIGMA17_SIGMA17_Msk & ((value) << PMERRLOC_SIGMA17_SIGMA17_Pos))
#define PMERRLOC_SIGMA17_Msk                  _U_(0x00003FFF)                                      /**< (PMERRLOC_SIGMA17) Register Mask  */


/* -------- PMERRLOC_SIGMA18 : (PMERRLOC Offset: 0x70) (R/W 32) SIGMA1 Register -------- */
#define PMERRLOC_SIGMA18_SIGMA18_Pos          _U_(0)                                               /**< (PMERRLOC_SIGMA18) Coefficient of Degree x in the SIGMA Polynomial. Position */
#define PMERRLOC_SIGMA18_SIGMA18_Msk          (_U_(0x3FFF) << PMERRLOC_SIGMA18_SIGMA18_Pos)        /**< (PMERRLOC_SIGMA18) Coefficient of Degree x in the SIGMA Polynomial. Mask */
#define PMERRLOC_SIGMA18_SIGMA18(value)       (PMERRLOC_SIGMA18_SIGMA18_Msk & ((value) << PMERRLOC_SIGMA18_SIGMA18_Pos))
#define PMERRLOC_SIGMA18_Msk                  _U_(0x00003FFF)                                      /**< (PMERRLOC_SIGMA18) Register Mask  */


/* -------- PMERRLOC_SIGMA19 : (PMERRLOC Offset: 0x74) (R/W 32) SIGMA1 Register -------- */
#define PMERRLOC_SIGMA19_SIGMA19_Pos          _U_(0)                                               /**< (PMERRLOC_SIGMA19) Coefficient of Degree x in the SIGMA Polynomial. Position */
#define PMERRLOC_SIGMA19_SIGMA19_Msk          (_U_(0x3FFF) << PMERRLOC_SIGMA19_SIGMA19_Pos)        /**< (PMERRLOC_SIGMA19) Coefficient of Degree x in the SIGMA Polynomial. Mask */
#define PMERRLOC_SIGMA19_SIGMA19(value)       (PMERRLOC_SIGMA19_SIGMA19_Msk & ((value) << PMERRLOC_SIGMA19_SIGMA19_Pos))
#define PMERRLOC_SIGMA19_Msk                  _U_(0x00003FFF)                                      /**< (PMERRLOC_SIGMA19) Register Mask  */


