Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/pmerrloc.h
/* -------- PMERRLOC_SIGMA20 : (PMERRLOC Offset: 0x78) (R/W 32) SIGMA1 Register -------- */
#define PMERRLOC_SIGMA20_SIGMA20_Pos          _U_(0)                                               /**< (PMERRLOC_SIGMA20) Coefficient of Degree x in the SIGMA Polynomial. Position */
#define PMERRLOC_SIGMA20_SIGMA20_Msk          (_U_(0x3FFF) << PMERRLOC_SIGMA20_SIGMA20_Pos)        /**< (PMERRLOC_SIGMA20) Coefficient of Degree x in the SIGMA Polynomial. Mask */
#define PMERRLOC_SIGMA20_SIGMA20(value)       (PMERRLOC_SIGMA20_SIGMA20_Msk & ((value) << PMERRLOC_SIGMA20_SIGMA20_Pos))
#define PMERRLOC_SIGMA20_Msk                  _U_(0x00003FFF)                                      /**< (PMERRLOC_SIGMA20) Register Mask  */


/* -------- PMERRLOC_SIGMA21 : (PMERRLOC Offset: 0x7C) (R/W 32) SIGMA1 Register -------- */
#define PMERRLOC_SIGMA21_SIGMA21_Pos          _U_(0)                                               /**< (PMERRLOC_SIGMA21) Coefficient of Degree x in the SIGMA Polynomial. Position */
#define PMERRLOC_SIGMA21_SIGMA21_Msk          (_U_(0x3FFF) << PMERRLOC_SIGMA21_SIGMA21_Pos)        /**< (PMERRLOC_SIGMA21) Coefficient of Degree x in the SIGMA Polynomial. Mask */
#define PMERRLOC_SIGMA21_SIGMA21(value)       (PMERRLOC_SIGMA21_SIGMA21_Msk & ((value) << PMERRLOC_SIGMA21_SIGMA21_Pos))
#define PMERRLOC_SIGMA21_Msk                  _U_(0x00003FFF)                                      /**< (PMERRLOC_SIGMA21) Register Mask  */


/* -------- PMERRLOC_SIGMA22 : (PMERRLOC Offset: 0x80) (R/W 32) SIGMA1 Register -------- */
#define PMERRLOC_SIGMA22_SIGMA22_Pos          _U_(0)                                               /**< (PMERRLOC_SIGMA22) Coefficient of Degree x in the SIGMA Polynomial. Position */
#define PMERRLOC_SIGMA22_SIGMA22_Msk          (_U_(0x3FFF) << PMERRLOC_SIGMA22_SIGMA22_Pos)        /**< (PMERRLOC_SIGMA22) Coefficient of Degree x in the SIGMA Polynomial. Mask */
#define PMERRLOC_SIGMA22_SIGMA22(value)       (PMERRLOC_SIGMA22_SIGMA22_Msk & ((value) << PMERRLOC_SIGMA22_SIGMA22_Pos))
#define PMERRLOC_SIGMA22_Msk                  _U_(0x00003FFF)                                      /**< (PMERRLOC_SIGMA22) Register Mask  */


/* -------- PMERRLOC_SIGMA23 : (PMERRLOC Offset: 0x84) (R/W 32) SIGMA1 Register -------- */
#define PMERRLOC_SIGMA23_SIGMA23_Pos          _U_(0)                                               /**< (PMERRLOC_SIGMA23) Coefficient of Degree x in the SIGMA Polynomial. Position */
#define PMERRLOC_SIGMA23_SIGMA23_Msk          (_U_(0x3FFF) << PMERRLOC_SIGMA23_SIGMA23_Pos)        /**< (PMERRLOC_SIGMA23) Coefficient of Degree x in the SIGMA Polynomial. Mask */
#define PMERRLOC_SIGMA23_SIGMA23(value)       (PMERRLOC_SIGMA23_SIGMA23_Msk & ((value) << PMERRLOC_SIGMA23_SIGMA23_Pos))
#define PMERRLOC_SIGMA23_Msk                  _U_(0x00003FFF)                                      /**< (PMERRLOC_SIGMA23) Register Mask  */


/* -------- PMERRLOC_SIGMA24 : (PMERRLOC Offset: 0x88) (R/W 32) SIGMA24 Register -------- */
#define PMERRLOC_SIGMA24_SIGMA24_Pos          _U_(0)                                               /**< (PMERRLOC_SIGMA24) Coefficient of Degree x in the SIGMA Polynomial. Position */
#define PMERRLOC_SIGMA24_SIGMA24_Msk          (_U_(0x3FFF) << PMERRLOC_SIGMA24_SIGMA24_Pos)        /**< (PMERRLOC_SIGMA24) Coefficient of Degree x in the SIGMA Polynomial. Mask */
#define PMERRLOC_SIGMA24_SIGMA24(value)       (PMERRLOC_SIGMA24_SIGMA24_Msk & ((value) << PMERRLOC_SIGMA24_SIGMA24_Pos))
#define PMERRLOC_SIGMA24_Msk                  _U_(0x00003FFF)                                      /**< (PMERRLOC_SIGMA24) Register Mask  */


/* -------- PMERRLOC_EL : (PMERRLOC Offset: 0x8C) ( R/ 32) Error Location 0 Register -------- */
#define PMERRLOC_EL_ERRLOCN_Pos               _U_(0)                                               /**< (PMERRLOC_EL) Error Position within the Set {sector area, spare area}. Position */
#define PMERRLOC_EL_ERRLOCN_Msk               (_U_(0x3FFF) << PMERRLOC_EL_ERRLOCN_Pos)             /**< (PMERRLOC_EL) Error Position within the Set {sector area, spare area}. Mask */
#define PMERRLOC_EL_ERRLOCN(value)            (PMERRLOC_EL_ERRLOCN_Msk & ((value) << PMERRLOC_EL_ERRLOCN_Pos))
#define PMERRLOC_EL_Msk                       _U_(0x00003FFF)                                      /**< (PMERRLOC_EL) Register Mask  */


/* -------- PMERRLOC_VERSION : (PMERRLOC Offset: 0x1FC) ( R/ 32) Version Register -------- */
#define PMERRLOC_VERSION_VERSION_Pos          _U_(0)                                               /**< (PMERRLOC_VERSION) Version of the Hardware Module Position */
#define PMERRLOC_VERSION_VERSION_Msk          (_U_(0xFFF) << PMERRLOC_VERSION_VERSION_Pos)         /**< (PMERRLOC_VERSION) Version of the Hardware Module Mask */
#define PMERRLOC_VERSION_VERSION(value)       (PMERRLOC_VERSION_VERSION_Msk & ((value) << PMERRLOC_VERSION_VERSION_Pos))
#define PMERRLOC_VERSION_MFN_Pos              _U_(16)                                              /**< (PMERRLOC_VERSION) Metal Fix Number Position */
#define PMERRLOC_VERSION_MFN_Msk              (_U_(0x7) << PMERRLOC_VERSION_MFN_Pos)               /**< (PMERRLOC_VERSION) Metal Fix Number Mask */
#define PMERRLOC_VERSION_MFN(value)           (PMERRLOC_VERSION_MFN_Msk & ((value) << PMERRLOC_VERSION_MFN_Pos))
#define PMERRLOC_VERSION_Msk                  _U_(0x00070FFF)                                      /**< (PMERRLOC_VERSION) Register Mask  */


/** \brief PMERRLOC register offsets definitions */
#define PMERRLOC_ELCFG_REG_OFST        (0x00)              /**< (PMERRLOC_ELCFG) Configuration Register Offset */
#define PMERRLOC_ELPRIM_REG_OFST       (0x04)              /**< (PMERRLOC_ELPRIM) Primitive Register Offset */
#define PMERRLOC_ELEN_REG_OFST         (0x08)              /**< (PMERRLOC_ELEN) Enable Register Offset */
#define PMERRLOC_ELDIS_REG_OFST        (0x0C)              /**< (PMERRLOC_ELDIS) Disable Register Offset */
#define PMERRLOC_ELSR_REG_OFST         (0x10)              /**< (PMERRLOC_ELSR) Status Register Offset */
#define PMERRLOC_ELIER_REG_OFST        (0x14)              /**< (PMERRLOC_ELIER) Interrupt Enable Register Offset */
#define PMERRLOC_ELIDR_REG_OFST        (0x18)              /**< (PMERRLOC_ELIDR) Interrupt Disable Register Offset */
#define PMERRLOC_ELIMR_REG_OFST        (0x1C)              /**< (PMERRLOC_ELIMR) Interrupt Mask Register Offset */
#define PMERRLOC_ELISR_REG_OFST        (0x20)              /**< (PMERRLOC_ELISR) Interrupt Status Register Offset */
#define PMERRLOC_SIGMA0_REG_OFST       (0x28)              /**< (PMERRLOC_SIGMA0) SIGMA0 Register Offset */
#define PMERRLOC_SIGMA1_REG_OFST       (0x2C)              /**< (PMERRLOC_SIGMA1) SIGMA1 Register Offset */
#define PMERRLOC_SIGMA2_REG_OFST       (0x30)              /**< (PMERRLOC_SIGMA2) SIGMA1 Register Offset */
#define PMERRLOC_SIGMA3_REG_OFST       (0x34)              /**< (PMERRLOC_SIGMA3) SIGMA1 Register Offset */
#define PMERRLOC_SIGMA4_REG_OFST       (0x38)              /**< (PMERRLOC_SIGMA4) SIGMA1 Register Offset */
#define PMERRLOC_SIGMA5_REG_OFST       (0x3C)              /**< (PMERRLOC_SIGMA5) SIGMA1 Register Offset */
#define PMERRLOC_SIGMA6_REG_OFST       (0x40)              /**< (PMERRLOC_SIGMA6) SIGMA1 Register Offset */
#define PMERRLOC_SIGMA7_REG_OFST       (0x44)              /**< (PMERRLOC_SIGMA7) SIGMA1 Register Offset */
#define PMERRLOC_SIGMA8_REG_OFST       (0x48)              /**< (PMERRLOC_SIGMA8) SIGMA1 Register Offset */
#define PMERRLOC_SIGMA9_REG_OFST       (0x4C)              /**< (PMERRLOC_SIGMA9) SIGMA1 Register Offset */
#define PMERRLOC_SIGMA10_REG_OFST      (0x50)              /**< (PMERRLOC_SIGMA10) SIGMA1 Register Offset */
#define PMERRLOC_SIGMA11_REG_OFST      (0x54)              /**< (PMERRLOC_SIGMA11) SIGMA1 Register Offset */
#define PMERRLOC_SIGMA12_REG_OFST      (0x58)              /**< (PMERRLOC_SIGMA12) SIGMA1 Register Offset */
#define PMERRLOC_SIGMA13_REG_OFST      (0x5C)              /**< (PMERRLOC_SIGMA13) SIGMA1 Register Offset */
#define PMERRLOC_SIGMA14_REG_OFST      (0x60)              /**< (PMERRLOC_SIGMA14) SIGMA1 Register Offset */
#define PMERRLOC_SIGMA15_REG_OFST      (0x64)              /**< (PMERRLOC_SIGMA15) SIGMA1 Register Offset */
#define PMERRLOC_SIGMA16_REG_OFST      (0x68)              /**< (PMERRLOC_SIGMA16) SIGMA1 Register Offset */
#define PMERRLOC_SIGMA17_REG_OFST      (0x6C)              /**< (PMERRLOC_SIGMA17) SIGMA1 Register Offset */
#define PMERRLOC_SIGMA18_REG_OFST      (0x70)              /**< (PMERRLOC_SIGMA18) SIGMA1 Register Offset */
#define PMERRLOC_SIGMA19_REG_OFST      (0x74)              /**< (PMERRLOC_SIGMA19) SIGMA1 Register Offset */
#define PMERRLOC_SIGMA20_REG_OFST      (0x78)              /**< (PMERRLOC_SIGMA20) SIGMA1 Register Offset */
#define PMERRLOC_SIGMA21_REG_OFST      (0x7C)              /**< (PMERRLOC_SIGMA21) SIGMA1 Register Offset */
#define PMERRLOC_SIGMA22_REG_OFST      (0x80)              /**< (PMERRLOC_SIGMA22) SIGMA1 Register Offset */
#define PMERRLOC_SIGMA23_REG_OFST      (0x84)              /**< (PMERRLOC_SIGMA23) SIGMA1 Register Offset */
#define PMERRLOC_SIGMA24_REG_OFST      (0x88)              /**< (PMERRLOC_SIGMA24) SIGMA24 Register Offset */
#define PMERRLOC_EL_REG_OFST           (0x8C)              /**< (PMERRLOC_EL) Error Location 0 Register Offset */
#define PMERRLOC_VERSION_REG_OFST      (0x1FC)             /**< (PMERRLOC_VERSION) Version Register Offset */

