Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/pmerrloc.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief PMERRLOC register API structure */
typedef struct
{
  __IO  uint32_t                       PMERRLOC_ELCFG;     /**< Offset: 0x00 (R/W  32) Configuration Register */
  __I   uint32_t                       PMERRLOC_ELPRIM;    /**< Offset: 0x04 (R/   32) Primitive Register */
  __IO  uint32_t                       PMERRLOC_ELEN;      /**< Offset: 0x08 (R/W  32) Enable Register */
  __IO  uint32_t                       PMERRLOC_ELDIS;     /**< Offset: 0x0C (R/W  32) Disable Register */
  __IO  uint32_t                       PMERRLOC_ELSR;      /**< Offset: 0x10 (R/W  32) Status Register */
  __O   uint32_t                       PMERRLOC_ELIER;     /**< Offset: 0x14 ( /W  32) Interrupt Enable Register */
  __O   uint32_t                       PMERRLOC_ELIDR;     /**< Offset: 0x18 ( /W  32) Interrupt Disable Register */
  __I   uint32_t                       PMERRLOC_ELIMR;     /**< Offset: 0x1C (R/   32) Interrupt Mask Register */
  __I   uint32_t                       PMERRLOC_ELISR;     /**< Offset: 0x20 (R/   32) Interrupt Status Register */
  __I   uint8_t                        Reserved1[0x04];
  __I   uint32_t                       PMERRLOC_SIGMA0;    /**< Offset: 0x28 (R/   32) SIGMA0 Register */
  __IO  uint32_t                       PMERRLOC_SIGMA1;    /**< Offset: 0x2C (R/W  32) SIGMA1 Register */
  __IO  uint32_t                       PMERRLOC_SIGMA2;    /**< Offset: 0x30 (R/W  32) SIGMA1 Register */
  __IO  uint32_t                       PMERRLOC_SIGMA3;    /**< Offset: 0x34 (R/W  32) SIGMA1 Register */
  __IO  uint32_t                       PMERRLOC_SIGMA4;    /**< Offset: 0x38 (R/W  32) SIGMA1 Register */
  __IO  uint32_t                       PMERRLOC_SIGMA5;    /**< Offset: 0x3C (R/W  32) SIGMA1 Register */
  __IO  uint32_t                       PMERRLOC_SIGMA6;    /**< Offset: 0x40 (R/W  32) SIGMA1 Register */
  __IO  uint32_t                       PMERRLOC_SIGMA7;    /**< Offset: 0x44 (R/W  32) SIGMA1 Register */
  __IO  uint32_t                       PMERRLOC_SIGMA8;    /**< Offset: 0x48 (R/W  32) SIGMA1 Register */
  __IO  uint32_t                       PMERRLOC_SIGMA9;    /**< Offset: 0x4C (R/W  32) SIGMA1 Register */
  __IO  uint32_t                       PMERRLOC_SIGMA10;   /**< Offset: 0x50 (R/W  32) SIGMA1 Register */
  __IO  uint32_t                       PMERRLOC_SIGMA11;   /**< Offset: 0x54 (R/W  32) SIGMA1 Register */
  __IO  uint32_t                       PMERRLOC_SIGMA12;   /**< Offset: 0x58 (R/W  32) SIGMA1 Register */
  __IO  uint32_t                       PMERRLOC_SIGMA13;   /**< Offset: 0x5C (R/W  32) SIGMA1 Register */
  __IO  uint32_t                       PMERRLOC_SIGMA14;   /**< Offset: 0x60 (R/W  32) SIGMA1 Register */
  __IO  uint32_t                       PMERRLOC_SIGMA15;   /**< Offset: 0x64 (R/W  32) SIGMA1 Register */
  __IO  uint32_t                       PMERRLOC_SIGMA16;   /**< Offset: 0x68 (R/W  32) SIGMA1 Register */
  __IO  uint32_t                       PMERRLOC_SIGMA17;   /**< Offset: 0x6C (R/W  32) SIGMA1 Register */
  __IO  uint32_t                       PMERRLOC_SIGMA18;   /**< Offset: 0x70 (R/W  32) SIGMA1 Register */
  __IO  uint32_t                       PMERRLOC_SIGMA19;   /**< Offset: 0x74 (R/W  32) SIGMA1 Register */
  __IO  uint32_t                       PMERRLOC_SIGMA20;   /**< Offset: 0x78 (R/W  32) SIGMA1 Register */
  __IO  uint32_t                       PMERRLOC_SIGMA21;   /**< Offset: 0x7C (R/W  32) SIGMA1 Register */
  __IO  uint32_t                       PMERRLOC_SIGMA22;   /**< Offset: 0x80 (R/W  32) SIGMA1 Register */
  __IO  uint32_t                       PMERRLOC_SIGMA23;   /**< Offset: 0x84 (R/W  32) SIGMA1 Register */
  __IO  uint32_t                       PMERRLOC_SIGMA24;   /**< Offset: 0x88 (R/W  32) SIGMA24 Register */
  __I   uint32_t                       PMERRLOC_EL[24];    /**< Offset: 0x8C (R/   32) Error Location 0 Register */
  __I   uint8_t                        Reserved2[0x110];
  __I   uint32_t                       PMERRLOC_VERSION;   /**< Offset: 0x1FC (R/   32) Version Register */
} pmerrloc_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAM9X_PMERRLOC_COMPONENT_H_ */
